readme.org
#+TITLE: Luca's nix configuration
#+STARTUP: content
#+HTML_HEAD: <script>var clicky_site_ids = clicky_site_ids || []; clicky_site_ids.push(101260027);</script>
#+HTML_HEAD: <script async src="//static.getclicky.com/js"></script>
#+STARTUP: content

* Introduction
** This repository
This repository contains my system configuration.
The main objective is to have a portable and reproducible system in order to for example bootstrap a new system in a quick and automated way.
The ideal is to share packages and configuration across different operating systems.
At the moment I only use a ~macOS~ system but I am prepared for the day I will switch to ~nixOS~

Tools:
- ~nix~ as a package manager
  + In particular, an experimental feature called ~flake~ to achieve complete reproducibility
- ~home-manager~ to configure packages and dotfiles
- ~nix-darwin~ to configure macOS systems (e.g. it has a great ~brew~ module)

** This file
This file (~readme.org~) is used to generate (the correct term is ~tangle~) my ~flake.nix~ file, where I specify the inputs and outputs of my system configuration.
The tangled ~flake.nix~ file imports other ~.nix~ files (e.g. ~darwin/default.nix~).

This file is better viewed in HTML format [[https://luca.cambiaghi.me/nixpkgs/readme.html][here]] or through ~org-mode~ (clone the repo and open in ~emacs~).
You can visit my blog at the same [[https://luca.cambiaghi.me][website]].

* flake.nix
** file structure
#+begin_src nix :tangle flake.nix :noweb tangle
# NOTE: this file is tangled from readme.org
# DO NOT edit by hand
{
  description = "Luca Cambiaghi's darwin configuration";
  <<inputs>>
  outputs = inputs@{ self, nixpkgs, darwin, home-manager, flake-utils, ... }:
    let
      <<nixpkgs-config>>
      <<home-manager-config>>
      <<nix-darwin-config>>
    in {
      darwinConfigurations = {
        <<luca-macbookpro>>
        <<github-ci>>
      };
      <<cloud-vm>>
      <<home-manager-modules>>
    } //
    <<dev-shell>>
}
#+end_src

** inputs
#+NAME: inputs
#+begin_src nix
inputs = {
  # Package sets
  nixpkgs.url = "github:nixos/nixpkgs/nixpkgs-unstable";
  nixpkgs-master.url = "github:nixos/nixpkgs/master";
  nixpkgs-stable-darwin.url = "github:nixos/nixpkgs/nixpkgs-20.09-darwin";
  nixos-stable.url = "github:nixos/nixpkgs/nixos-20.09";

  # Environment/system management
  darwin.url = "github:lnl7/nix-darwin";
  darwin.inputs.nixpkgs.follows = "nixpkgs";
  home-manager.url = "github:nix-community/home-manager";
  home-manager.inputs.nixpkgs.follows = "nixpkgs";

  # Other sources
  emacs.url = "github:nix-community/emacs-overlay";
  fish-done = { url = "github:franciscolourenco/done"; flake = false; };
  flake-compat = { url = "github:edolstra/flake-compat"; flake = false; };
  flake-utils.url = "github:numtide/flake-utils";
};
#+end_src

** nixpkgs config
The trick in the ~overlays~ variable allows us to use the stable version of problematic
packages. You can just use ~stable.pkg~ instead of ~pkg~ in ~home/default.nix~

#+NAME: nixpkgs-config
#+begin_src nix
nixpkgsConfig = with inputs; {
  config = {
    allowUnfree = true;
    allowUnsupportedSystem = true;
  };
  overlays = [
    (
      final: prev:
      let
        system = prev.stdenv.system;
        nixpkgs-stable = if system == "x86_64-darwin" then nixpkgs-stable-darwin else nixos-stable;
      in {
        master = nixpkgs-master.legacyPackages.${system};
        stable = nixpkgs-stable.legacyPackages.${system};
      }
    )
    emacs.overlay
  ];
};
#+end_src

** home-manager config
#+NAME: home-manager-config
#+begin_src nix
homeManagerCommonConfig = with self.homeManagerModules; {
  imports = [
    ./home
    # configs.git.aliases
    # configs.starship.symbols
    # programs.kitty.extras
  ];
};
#+end_src

