readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-20 Thu 00:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Luca's nix configuration</title>
<meta name="author" content="Luca Cambiaghi" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<div id="toggle-theme">dark theme</div><div id="toggle-toc">&#9776;</div>
</div>
<div id="content">
<h1 class="title">Luca's nix configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7b1aa29">1. Introduction</a>
<ul>
<li><a href="#org5464f9e">1.1. This repository</a></li>
<li><a href="#org8971291">1.2. This file</a></li>
</ul>
</li>
<li><a href="#org42fe3e8">2. flake.nix</a>
<ul>
<li><a href="#org0ec4586">2.1. file structure</a></li>
<li><a href="#orge335c1d">2.2. inputs</a></li>
<li><a href="#orge28ed17">2.3. nixpkgs config</a></li>
<li><a href="#org3bbffa7">2.4. home-manager config</a></li>
<li><a href="#org7bd1662">2.5. nix-darwin config</a></li>
<li><a href="#org369ab4f">2.6. luca-macbook-pro</a></li>
<li><a href="#org86658c4">2.7. github-ci</a></li>
<li><a href="#orgbce718d">2.8. home-manager-modules</a></li>
<li><a href="#org39cb4ec">2.9. cloud-vm</a></li>
<li><a href="#org5ef742e">2.10. dev-shell</a></li>
</ul>
</li>
<li><a href="#org82d5366">3. Practical commands</a>
<ul>
<li><a href="#orgb3842a0">3.1. Install nix (flakes)</a></li>
<li><a href="#org0ab1a4d">3.2. darwin-rebuild</a></li>
<li><a href="#orge5384e3">3.3. nix flake update</a></li>
</ul>
</li>
<li><a href="#orgc679e38">4. Nix</a>
<ul>
<li><a href="#orgbf96fed">4.1. Fundamentals</a></li>
<li><a href="#org4d1d332">4.2. Config</a></li>
<li><a href="#org0dbabd0">4.3. Derivation</a></li>
<li><a href="#org3b87f9f">4.4. Escaping in strings</a></li>
</ul>
</li>
<li><a href="#orga1939e8">5. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7b1aa29" class="outline-2">
<h2 id="org7b1aa29"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5464f9e" class="outline-3">
<h3 id="org5464f9e"><span class="section-number-3">1.1</span> This repository</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This repository contains my system configuration.
The main objective is to have a portable and reproducible system in order to for example bootstrap a new system in a quick and automated way.
The ideal is to share packages and configuration across different operating systems.
At the moment I only use a <code>macOS</code> system but I am prepared for the day I will switch to <code>nixOS</code>
</p>

<p>
Tools:
</p>
<ul class="org-ul">
<li><code>nix</code> as a package manager
<ul class="org-ul">
<li>In particular, an experimental feature called <code>flake</code> to achieve complete reproducibility</li>
</ul></li>
<li><code>home-manager</code> to configure packages and dotfiles</li>
<li><code>nix-darwin</code> to configure macOS systems (e.g. it has a great <code>brew</code> module)</li>
</ul>
</div>
</div>

<div id="outline-container-org8971291" class="outline-3">
<h3 id="org8971291"><span class="section-number-3">1.2</span> This file</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This file (<code>readme.org</code>) is used to generate (the correct term is <code>tangle</code>) my <code>flake.nix</code> file, where I specify the inputs and outputs of my system configuration.
The tangled <code>flake.nix</code> file imports other <code>.nix</code> files (e.g. <code>darwin/default.nix</code>).
</p>

<p>
This file is better viewed in HTML format <a href="https://luca.cambiaghi.me/nixpkgs/readme.html">here</a> or through <code>org-mode</code> (clone the repo and open in <code>emacs</code>).
You can visit my blog at the same <a href="https://luca.cambiaghi.me">website</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org42fe3e8" class="outline-2">
<h2 id="org42fe3e8"><span class="section-number-2">2</span> flake.nix</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0ec4586" class="outline-3">
<h3 id="org0ec4586"><span class="section-number-3">2.1</span> file structure</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-nix"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">NOTE: this file is tangled from readme.org</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">DO NOT edit by hand</span>
{
  <span style="color: #00d3d0;">description</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"Luca Cambiaghi's darwin configuration"</span>;
  &lt;<span style="color: #00bcff;">&lt;inputs&gt;</span>&gt;
  <span style="color: #00d3d0;">outputs</span> = inputs@{ self, nixpkgs, darwin, home-manager, flake-utils, ... }:
    <span style="color: #b6a0ff; font-weight: bold;">let</span>
      &lt;<span style="color: #00bcff;">&lt;nixpkgs-config&gt;</span>&gt;
      &lt;<span style="color: #00bcff;">&lt;home-manager-config&gt;</span>&gt;
      &lt;<span style="color: #00bcff;">&lt;nix-darwin-config&gt;</span>&gt;
    <span style="color: #b6a0ff; font-weight: bold;">in</span> {
      <span style="color: #00d3d0;">darwinConfigurations</span> = {
        &lt;<span style="color: #00bcff;">&lt;luca-macbookpro&gt;</span>&gt;
        &lt;<span style="color: #00bcff;">&lt;github-ci&gt;</span>&gt;
      };
      &lt;<span style="color: #00bcff;">&lt;cloud-vm&gt;</span>&gt;
      &lt;<span style="color: #00bcff;">&lt;home-manager-modules&gt;</span>&gt;
    } //
    &lt;<span style="color: #00bcff;">&lt;dev-shell&gt;</span>&gt;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge335c1d" class="outline-3">
<h3 id="orge335c1d"><span class="section-number-3">2.2</span> inputs</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-nix" id="orgde51abc"><span style="color: #00d3d0;">inputs</span> = {
  <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># Package sets</span>
  <span style="color: #00d3d0;">nixpkgs.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:nixos/nixpkgs/nixpkgs-unstable"</span>;
  <span style="color: #00d3d0;">nixpkgs-master.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:nixos/nixpkgs/master"</span>;
  <span style="color: #00d3d0;">nixpkgs-stable-darwin.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:nixos/nixpkgs/nixpkgs-20.09-darwin"</span>;
  <span style="color: #00d3d0;">nixos-stable.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:nixos/nixpkgs/nixos-20.09"</span>;

  <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># Environment/system management</span>
  <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># darwin.url = "github:lnl7/nix-darwin";</span>
  <span style="color: #00d3d0;">darwin.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:hardselius/nix-darwin"</span>;
  <span style="color: #00d3d0;">darwin.inputs.nixpkgs.follows</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"nixpkgs"</span>;
  <span style="color: #00d3d0;">home-manager.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:nix-community/home-manager"</span>;
  <span style="color: #00d3d0;">home-manager.inputs.nixpkgs.follows</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"nixpkgs"</span>;

  <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># Other sources</span>
  <span style="color: #00d3d0;">emacs.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:nix-community/emacs-overlay"</span>;
  <span style="color: #00d3d0;">fish-done</span> = { <span style="color: #00d3d0;">url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:franciscolourenco/done"</span>; <span style="color: #00d3d0;">flake</span> = <span style="color: #f78fe7; font-weight: bold;">false</span>; };
  <span style="color: #00d3d0;">flake-compat</span> = { <span style="color: #00d3d0;">url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:edolstra/flake-compat"</span>; <span style="color: #00d3d0;">flake</span> = <span style="color: #f78fe7; font-weight: bold;">false</span>; };
  <span style="color: #00d3d0;">flake-utils.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:numtide/flake-utils"</span>;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-orge28ed17" class="outline-3">
<h3 id="orge28ed17"><span class="section-number-3">2.3</span> nixpkgs config</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The trick in the <code>overlays</code> variable allows us to use the stable version of problematic
packages. You can just use <code>stable.pkg</code> instead of <code>pkg</code> in <code>home/default.nix</code>
</p>

<div class="org-src-container">
<pre class="src src-nix" id="org773fbbd"><span style="color: #00d3d0;">nixpkgsConfig</span> = <span style="color: #b6a0ff; font-weight: bold;">with</span> inputs; {
  <span style="color: #00d3d0;">config</span> = {
    <span style="color: #00d3d0;">allowUnfree</span> = <span style="color: #f78fe7; font-weight: bold;">true</span>;
    <span style="color: #00d3d0;">allowUnsupportedSystem</span> = <span style="color: #f78fe7; font-weight: bold;">true</span>;
  };
  <span style="color: #00d3d0;">overlays</span> = [
    (
      final: prev:
      <span style="color: #b6a0ff; font-weight: bold;">let</span>
        <span style="color: #00d3d0;">system</span> = prev.stdenv.system;
        <span style="color: #00d3d0;">nixpkgs-stable</span> = <span style="color: #b6a0ff; font-weight: bold;">if</span> system == <span style="color: var(--clr-string); background-color: var(--bg-string);">"x86_64-darwin"</span> <span style="color: #b6a0ff; font-weight: bold;">then</span> nixpkgs-stable-darwin <span style="color: #b6a0ff; font-weight: bold;">else</span> nixos-stable;
      <span style="color: #b6a0ff; font-weight: bold;">in</span> {
        <span style="color: #00d3d0;">master</span> = nixpkgs-master.legacyPackages.${system};
        <span style="color: #00d3d0;">stable</span> = nixpkgs-stable.legacyPackages.${system};
      }
    )
    emacs.overlay
  ];
};
</pre>
</div>
</div>
</div>
