readme.org
** nix-darwin config
#+NAME: nix-darwin-config
#+begin_src nix
nixDarwinCommonModules = { user }: [
  # Main `nix-darwin` config
  ./darwin
  # `home-manager` module
  home-manager.darwinModules.home-manager
  {
    nixpkgs = nixpkgsConfig;
    # Hack to support legacy worklows that use `<nixpkgs>` etc.
    # nix.nixPath = { nixpkgs = "$HOME/.config/nixpkgs/nixpkgs.nix"; };
    # `home-manager` config
    users.users.${user}.home = "/Users/${user}";
    home-manager.useGlobalPkgs = true;
    home-manager.users.${user} = homeManagerCommonConfig;
  }
];
#+end_src

** luca-macbook-pro
#+NAME: luca-macbookpro
#+begin_src nix
luca-macbookpro = darwin.lib.darwinSystem {
  modules = nixDarwinCommonModules { user = "luca"; } ++ [
    {
      networking = {
        knownNetworkServices = ["Wi-Fi" "Bluetooth PAN" "Thunderbolt Bridge"];
        hostName =  "luca-macbookpro";
        computerName = "luca-macbookpro";
        localHostName = "luca-macbookpro";
      };
    }
  ];
  specialArgs = { inherit inputs nixpkgs; };
};
#+end_src

** github-ci
#+NAME: github-ci
#+begin_src nix
githubCI = darwin.lib.darwinSystem {
  modules = nixDarwinCommonModules { user = "runner"; } ++ [
    ({ lib, ... }: { homebrew.enable = lib.mkForce false; })
  ];
};
#+end_src

** home-manager-modules
#+NAME: home-manager-modules
#+begin_src nix
# homeManagerModules = {
#   configs.git.aliases = import ./home/configs/git-aliases.nix;
#   configs.gh.aliases = import ./home/configs/gh-aliases.nix;
#   configs.starship.symbols = import ./home/configs/starship-symbols.nix;
#   programs.neovim.extras = import ./home/modules/programs/neovim/extras.nix;
#   programs.kitty.extras = import ./home/modules/programs/kitty/extras.nix;
# };
#+end_src

** cloud-vm
Build and activate with ~nix build .#cloudVM.activationPackage; ./result/activate~
#+NAME: cloud-vm
#+begin_src nix
cloudVM = home-manager.lib.homeManagerConfiguration {
  system = "x86_64-linux";
  homeDirectory = "/home/luca";
  username = "luca";
  configuration = {
    imports = [ homeManagerCommonConfig ];
    nixpkgs = nixpkgsConfig;
  };
};
#+end_src

** dev-shell
#+NAME: dev-shell
#+begin_src nix
inputs.flake-utils.lib.eachDefaultSystem (system:
  let
    pkgs = nixpkgs.legacyPackages.${system};
  in {
    devShell = import ./shell.nix { inherit pkgs; };
  });
#+end_src

* Practical commands
** Install nix (flakes)
thanks https://github.com/kclejeune/system
#+begin_src sh
# 1.
if [[ $(uname -s) == 'Darwin' ]]; then
    # sh <(curl -L https://nixos.org/nix/install) --daemon --darwin-use-unencrypted-nix-store-volume
    sh <(curl -L https://github.com/numtide/nix-flakes-installer/releases/download/nix-2.4pre20210126_f15f0b8/install) --daemon --darwin-use-unencrypted-nix-store-volume
else
    sh <(curl -L https://nixos.org/nix/install) --daemon
fi

# 2.
git clone git@github.com:lccambiaghi/nixpkgs.git ~/git/nixpkgs

# 3.
cd ~/git/nixpkgs && nix build ".#darwinConfigurations.luca-macbookpro.system" && ./result/sw/bin/darwin-rebuild switch --flake .#luca-macbookpro
#+end_src

** darwin-rebuild
#+begin_src sh
darwin-rebuild build --flake .#luca-macbookpro
# nix build ".#darwinConfigurations.luca-macbookpro.system"
darwin-rebuild switch --flake .#luca-macbookpro
# ./result/sw/bin/darwin-rebuild switch --flake .#luca-macbookpro
#+end_src

** nix flake update
#+begin_src sh
nix flake update --update-input nixpkgs
#+end_src

