readme.html

<div id="outline-container-org3bbffa7" class="outline-3">
<h3 id="org3bbffa7"><span class="section-number-3">2.4</span> home-manager config</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-nix" id="org84f1f5b"><span style="color: #00d3d0;">homeManagerCommonConfig</span> = <span style="color: #b6a0ff; font-weight: bold;">with</span> self.homeManagerModules; {
  <span style="color: #00d3d0;">imports</span> = [
    <span style="color: #00bcff;">./home</span>
    <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># configs.git.aliases</span>
    <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># configs.starship.symbols</span>
    <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># programs.kitty.extras</span>
  ];
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bd1662" class="outline-3">
<h3 id="org7bd1662"><span class="section-number-3">2.5</span> nix-darwin config</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-nix" id="orgba6bc00"><span style="color: #00d3d0;">nixDarwinCommonModules</span> = { user }: [
  <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># Main `nix-darwin` config</span>
  <span style="color: #00bcff;">./darwin</span>
  <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># `home-manager` module</span>
  home-manager.darwinModules.home-manager
  {
    <span style="color: #00d3d0;">nixpkgs</span> = nixpkgsConfig;
    <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># Hack to support legacy worklows that use `&lt;nixpkgs&gt;` etc.</span>
    <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># nix.nixPath = { nixpkgs = "$HOME/.config/nixpkgs/nixpkgs.nix"; };</span>
    <span style="color: var(--clr-comment); background-color: var(--bg-comment);"># `home-manager` config</span>
    users.users.${user}.<span style="color: #00d3d0;">home</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"/Users/</span><span style="color: #ff9977;">${</span>user<span style="color: #ff9977;">}</span>";
    <span style="color: #00d3d0;">home-manager.useGlobalPkgs</span> = <span style="color: #f78fe7; font-weight: bold;">true</span>;
    home-manager.users.${user} = homeManagerCommonConfig;
  }
];
</pre>
</div>
</div>
</div>

<div id="outline-container-org369ab4f" class="outline-3">
<h3 id="org369ab4f"><span class="section-number-3">2.6</span> luca-macbook-pro</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-nix" id="orgfe971cd"><span style="color: #00d3d0;">luca-macbookpro</span> = darwin.lib.darwinSystem {
  <span style="color: #00d3d0;">modules</span> = nixDarwinCommonModules { <span style="color: #00d3d0;">user</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"luca"</span>; } ++ [
    {
      <span style="color: #00d3d0;">networking</span> = {
        <span style="color: #00d3d0;">knownNetworkServices</span> = [<span style="color: var(--clr-string); background-color: var(--bg-string);">"Wi-Fi"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Bluetooth PAN"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Thunderbolt Bridge"</span>];
        <span style="color: #00d3d0;">hostName</span> =  <span style="color: var(--clr-string); background-color: var(--bg-string);">"luca-macbookpro"</span>;
        <span style="color: #00d3d0;">computerName</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"luca-macbookpro"</span>;
        <span style="color: #00d3d0;">localHostName</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"luca-macbookpro"</span>;
      };
    }
  ];
  <span style="color: #00d3d0;">specialArgs</span> = { <span style="color: #b6a0ff; font-weight: bold;">inherit</span> inputs nixpkgs; };
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org86658c4" class="outline-3">
<h3 id="org86658c4"><span class="section-number-3">2.7</span> github-ci</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-nix" id="orga3a069f"><span style="color: #00d3d0;">githubCI</span> = darwin.lib.darwinSystem {
  <span style="color: #00d3d0;">modules</span> = nixDarwinCommonModules { <span style="color: #00d3d0;">user</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"runner"</span>; } ++ [
    ({ lib, ... }: { <span style="color: #00d3d0;">homebrew.enable</span> = lib.mkForce <span style="color: #f78fe7; font-weight: bold;">false</span>; })
  ];
};
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbce718d" class="outline-3">
<h3 id="orgbce718d"><span class="section-number-3">2.8</span> home-manager-modules</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-nix" id="org7a22f67"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">homeManagerModules = {</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">#   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">configs.git.aliases = import ./home/configs/git-aliases.nix;</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">#   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">configs.gh.aliases = import ./home/configs/gh-aliases.nix;</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">#   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">configs.starship.symbols = import ./home/configs/starship-symbols.nix;</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">#   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">programs.neovim.extras = import ./home/modules/programs/neovim/extras.nix;</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">#   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">programs.kitty.extras = import ./home/modules/programs/kitty/extras.nix;</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">};</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org39cb4ec" class="outline-3">
<h3 id="org39cb4ec"><span class="section-number-3">2.9</span> cloud-vm</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Build and activate with <code>nix build .#cloudVM.activationPackage; ./result/activate</code>
</p>
<div class="org-src-container">
<pre class="src src-nix" id="org9e0e4ac"><span style="color: #00d3d0;">cloudVM</span> = home-manager.lib.homeManagerConfiguration {
  <span style="color: #00d3d0;">system</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"x86_64-linux"</span>;
  <span style="color: #00d3d0;">homeDirectory</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"/home/luca"</span>;
  <span style="color: #00d3d0;">username</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"luca"</span>;
  <span style="color: #00d3d0;">configuration</span> = {
    <span style="color: #00d3d0;">imports</span> = [ homeManagerCommonConfig ];
    <span style="color: #00d3d0;">nixpkgs</span> = nixpkgsConfig;
  };
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ef742e" class="outline-3">
<h3 id="org5ef742e"><span class="section-number-3">2.10</span> dev-shell</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-nix" id="org458b725">inputs.flake-utils.lib.eachDefaultSystem (system:
  <span style="color: #b6a0ff; font-weight: bold;">let</span>
    <span style="color: #00d3d0;">pkgs</span> = nixpkgs.legacyPackages.${system};
  <span style="color: #b6a0ff; font-weight: bold;">in</span> {
    <span style="color: #00d3d0;">devShell</span> = <span style="color: #f78fe7; font-weight: bold;">import</span> <span style="color: #00bcff;">./shell.nix</span> { <span style="color: #b6a0ff; font-weight: bold;">inherit</span> pkgs; };
  });
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org82d5366" class="outline-2">
<h2 id="org82d5366"><span class="section-number-2">3</span> Practical commands</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb3842a0" class="outline-3">
<h3 id="orgb3842a0"><span class="section-number-3">3.1</span> Install nix (flakes)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
thanks <a href="https://github.com/kclejeune/system">https://github.com/kclejeune/system</a>
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">1.</span>
<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> [[ $(uname -s) == <span style="color: var(--clr-string); background-color: var(--bg-string);">'Darwin'</span> ]]; <span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">then</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">sh &lt;(curl -L https://nixos.org/nix/install) --daemon --darwin-use-unencrypted-nix-store-volume</span>
    sh &lt;(curl -L https://github.com/numtide/nix-flakes-installer/releases/download/nix-2.4pre20210126_f15f0b8/install) --daemon --darwin-use-unencrypted-nix-store-volume
<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">else</span>
    sh &lt;(curl -L https://nixos.org/nix/install) --daemon
<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">fi</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">2.</span>
git clone git@github.com:lccambiaghi/nixpkgs.git ~/git/nixpkgs

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">3.</span>
<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">cd</span> ~/git/nixpkgs &amp;&amp; nix build <span style="color: var(--clr-string); background-color: var(--bg-string);">".#darwinConfigurations.luca-macbookpro.system"</span> &amp;&amp; ./result/sw/bin/darwin-rebuild switch --flake .#luca-macbookpro
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ab1a4d" class="outline-3">
<h3 id="org0ab1a4d"><span class="section-number-3">3.2</span> darwin-rebuild</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh">darwin-rebuild build --flake .#luca-macbookpro
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">nix build ".#darwinConfigurations.luca-macbookpro.system"</span>
darwin-rebuild switch --flake .#luca-macbookpro
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">./result/sw/bin/darwin-rebuild switch --flake .#luca-macbookpro</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5384e3" class="outline-3">
<h3 id="orge5384e3"><span class="section-number-3">3.3</span> nix flake update</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sh">nix flake update --update-input nixpkgs
</pre>
</div>
</div>
</div>
</div>
